{
  "backend/main.mo": "Main actor implementing user profiles, order management (place/update/get/list), repair orders, piercing services, and other services with authorization checks and migration support.",
  "backend/migration.mo": "Migration module converting old Nat-based weight/cost fields to Int types across orders, repair orders, piercing services, and other services.",
  "feature_evidence.json": "Feature evidence report documenting wizard form workflow validation with high confidence, linking to mutation hooks and test ID REQ-5.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, views, and utilities for orders, repairs, piercing, and other services.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining light and dark mode variables for jewellery-themed UI.",
  "frontend/index.html": "HTML entry point with root div and module script reference for the React application.",
  "frontend/src/App.tsx": "Main app component managing authentication, view routing (dashboard/wizard/orders/repair/services), and coordinating CRUD flows with separate state for orders, repairs, piercing, and other services.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice with current year.",
  "frontend/src/components/Header.tsx": "Application header with branding, login/logout button, and Misc dropdown menu for navigating to Piercing and Other service forms.",
  "frontend/src/components/LoginPrompt.tsx": "Renders a login card with Internet Identity authentication, displaying a welcome message and login button with loading state.",
  "frontend/src/components/ProfileSetup.tsx": "Empty file with no content.",
  "frontend/src/components/StepIndicator.tsx": "Displays a multi-step progress indicator with numbered circles, check marks for completed steps, and connecting lines between steps.",
  "frontend/src/features/dashboard/DashboardView.tsx": "Main dashboard component displaying statistics cards for orders, repairs, piercing, and other services, along with recent records tables and navigation callbacks.",
  "frontend/src/features/dashboard/useOrderStats.ts": "React Query hook that fetches order statistics from the backend actor.",
  "frontend/src/features/misc/otherTypes.ts": "Defines TypeScript types and initial state for other service form data (name, phone, amount, remarks).",
  "frontend/src/features/misc/OtherWizard.tsx": "Two-step wizard form for creating other services with contact details and amount/remarks, including validation and save functionality.",
  "frontend/src/features/misc/piercingTypes.ts": "Defines TypeScript types and initial state for piercing service form data including date, contact info, amount, and remarks.",
  "frontend/src/features/misc/PiercingWizard.tsx": "Two-step wizard form for creating piercing services with date, contact details, amount, and remarks fields with validation.",
  "frontend/src/features/misc/useGetOtherService.ts": "React Query hook that fetches a single other service record by ID with error handling for authorization and not found cases.",
  "frontend/src/features/misc/useGetPiercingService.ts": "React Query hook that fetches a single piercing service record by ID with error handling for authorization and not found cases.",
  "frontend/src/features/misc/useOtherServiceStats.ts": "React Query hook that fetches statistics for other services with authorization error handling.",
  "frontend/src/features/misc/usePiercingServiceStats.ts": "React Query hook that fetches piercing service statistics with authorization error handling.",
  "frontend/src/features/misc/usePlaceOtherService.ts": "React Query mutation hook that creates a new other service, sanitizes currency values to cents, and invalidates related caches on success.",
  "frontend/src/features/misc/usePlacePiercingService.ts": "React Query mutation hook for adding piercing services; sanitizes currency (stores as cents) and converts dates to nanoseconds, then invalidates related queries on success.",
  "frontend/src/features/misc/useRecentOtherServices.ts": "React Query hook that fetches recent \"other\" service records from the backend actor with authorization error handling.",
  "frontend/src/features/misc/useRecentPiercingServices.ts": "React Query hook that fetches recent piercing service records from the backend actor with authorization error handling.",
  "frontend/src/features/orders/OrdersView.tsx": "Displays a table of recent orders with status badges, edit actions, and success messages; provides a button to create new orders.",
  "frontend/src/features/orders/orderTypes.ts": "Defines TypeScript types, constants, and business logic for order forms including materials, order types, statuses, and weight field enablement rules.",
  "frontend/src/features/orders/OrderWizard.tsx": "Multi-step wizard component for creating or editing orders with validation, weight/amount calculations, and conditional field enabling based on material and order type.",
  "frontend/src/features/orders/useGetOrder.ts": "React Query hook that fetches a single order by bill number with error handling for authorization and not-found cases.",
  "frontend/src/features/orders/usePlaceOrder.ts": "React Query mutation hook for creating new orders; sanitizes weight fields and invalidates order-related queries on success.",
  "frontend/src/features/orders/useRecentOrders.ts": "React Query hook that fetches a list of recent orders from the backend actor.",
  "frontend/src/features/orders/useUpdateOrder.ts": "React Query mutation hook for updating existing orders; sanitizes weights, converts delivery dates to nanoseconds, and invalidates queries on success.",
  "frontend/src/features/repairs/RepairOrdersView.tsx": "Displays a table of recent repair orders with filtering, status badges, and edit actions. Shows success alerts after creating/updating repairs and handles loading/error states.",
  "frontend/src/features/repairs/repairTypes.ts": "Defines TypeScript types and constants for repair orders including materials, statuses, delivery statuses, and the RepairFormData interface with initial values.",
  "frontend/src/features/repairs/RepairWizard.tsx": "Multi-step form wizard for creating and editing repair orders with validation. Handles data loading for edit mode, auto-calculates total cost, and manages form state across three steps.",
  "frontend/src/features/repairs/useGetRepairOrder.ts": "React Query hook to fetch a single repair order by ID from the backend actor with error handling for authorization and not-found cases.",
  "frontend/src/features/repairs/usePlaceRepairOrder.ts": "React Query mutation hook to create new repair orders, sanitizing weight and currency values, converting dates to nanoseconds, and invalidating related queries on success.",
  "frontend/src/features/repairs/useRecentRepairOrders.ts": "React Query hook to fetch a list of recent repair orders with configurable count from the backend actor.",
  "frontend/src/features/repairs/useRepairOrderStats.ts": "React Query hook to fetch aggregate statistics for repair orders from the backend actor.",
  "frontend/src/features/repairs/useUpdateRepairOrder.ts": "React Query mutation hook to update existing repair orders with sanitization logic matching the create hook, handling authorization and not-found errors.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on authentication state, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity persistence, and providing authentication status throughout the application.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query hook `useGetCallerUserRole` that fetches the current user's role from the actor, though it's noted as currently unused since profile functionality is not available in the backend.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a jewellery-themed color palette (warm gold, amber, copper/rose gold) for both light and dark modes, plus base styling for body and border elements.",
  "frontend/src/lib/formatters.ts": "Utility functions for formatting data: `formatDate` converts nanosecond timestamps to readable date strings, and `formatWeight` converts stored weight values (weight * 100) to decimal display format.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and sessionStorage values, supporting both regular query strings and hash-based routing with persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom colors using OKLCH color space, container settings, font families (Inter), border radius variables, shadows, and accordion animations.",
  "project_state.json": "Project metadata tracking a fix request to restore version 13 functionality broken in version 14, while preserving the new material field disabling feature, with requirements for validating all wizard workflows and service type operations."
}