{
  "backend/main.mo": "Main actor implementing user profile management and order management with authorization checks, including CRUD operations for orders with auto-incrementing bill numbers and persistent storage using Map data structures.",
  "backend/migration.mo": "Migration module that handles data transformation from old actor state (userProfiles) to new actor state (persistentUserProfiles) during canister upgrades.",
  "feature_evidence.json": "Feature evidence report documenting frontend error handling and data validation improvements in OrderWizard with high confidence, listing affected service hooks and formatters.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, utilities, and features with emphasis on error handling, validation, and multi-step wizards for orders, repairs, and services.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system variables for light and dark modes with jewellery-themed warm tones and neutral palettes.",
  "frontend/index.html": "HTML entry point with root div and module script reference for the React application titled 'Jewellery order/billing app'.",
  "frontend/src/App.tsx": "Root application component managing authentication, view routing between dashboard/wizard/orders/repairs/services, edit state with number IDs, and success payload coordination with toast notifications.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice with current year in a bordered card layout.",
  "frontend/src/components/Header.tsx": "Application header with branding, Internet Identity login/logout, and dropdown menu for Misc services (Piercing and Other) with navigation callbacks.",
  "frontend/src/components/LoginPrompt.tsx": "Login card component prompting unauthenticated users to login with Internet Identity, featuring jewellery branding and loading states.",
  "frontend/src/components/ProfileSetup.tsx": "Empty component file for profile setup functionality (no implementation present).",
  "frontend/src/components/StepIndicator.tsx": "Reusable multi-step progress indicator component displaying numbered steps with labels, check marks for completed steps, and connecting lines with visual state transitions.",
  "frontend/src/features/dashboard/DashboardView.tsx": "Main dashboard component that displays statistics cards and recent records for orders, repairs, piercing services, and other services, with quick action buttons to create or edit each type.",
  "frontend/src/features/dashboard/useOrderStats.ts": "React Query hook that fetches order statistics from the backend actor.",
  "frontend/src/features/misc/otherTypes.ts": "TypeScript types and initial form data for other service forms (name, phone, amount, remarks).",
  "frontend/src/features/misc/OtherWizard.tsx": "Two-step wizard form for creating other services with contact details and amount/remarks, using validation and mutation hooks.",
  "frontend/src/features/misc/piercingTypes.ts": "TypeScript types and initial form data for piercing service forms (date, name, phone, amount, remarks).",
  "frontend/src/features/misc/PiercingWizard.tsx": "Two-step wizard form for creating piercing services with date/contact details and amount/remarks, using validation and mutation hooks.",
  "frontend/src/features/misc/useGetOtherService.ts": "React Query hook that fetches a single other service record by ID with error handling for authorization and not found cases.",
  "frontend/src/features/misc/useGetPiercingService.ts": "React Query hook that fetches a single piercing service record by ID with error handling for authorization and not found cases.",
  "frontend/src/features/misc/useOtherServiceStats.ts": "React Query hook that fetches statistics for other services with authorization error handling.",
  "frontend/src/features/misc/usePiercingServiceStats.ts": "React Query hook that fetches statistics for piercing services with authorization error handling.",
  "frontend/src/features/misc/usePlaceOtherService.ts": "React Query mutation hook that creates a new other service, converting currency to bigint cents and invalidating related queries on success.",
  "frontend/src/features/misc/usePlacePiercingService.ts": "React Query mutation hook that creates a new piercing service, converting date to nanoseconds and currency to bigint cents, then invalidating related queries on success.",
  "frontend/src/features/misc/useRecentOtherServices.ts": "React Query hook that fetches a list of recent other service records with configurable count and authorization error handling.",
  "frontend/src/features/misc/useRecentPiercingServices.ts": "React Query hook that fetches a list of recent piercing service records with configurable count and authorization error handling.",
  "frontend/src/features/orders/OrdersView.tsx": "Displays a table of recent orders with filtering, status badges, and actions for editing. Shows success messages and handles loading/error states using the useRecentOrders hook.",
  "frontend/src/features/orders/orderTypes.ts": "Defines TypeScript types, constants, and utility functions for order management including materials, order types, statuses, form data structure, and weight field enablement logic based on order type.",
  "frontend/src/features/orders/OrderWizard.tsx": "Multi-step wizard component for creating and editing orders with form validation, weight calculations, and conditional field enabling based on material and order type. Handles both new order creation via usePlaceOrder and updates via useUpdateOrder hooks.",
  "frontend/src/features/orders/useGetOrder.ts": "React Query hook that fetches a single order by bill number from the backend actor with error handling for authorization and not-found cases.",
  "frontend/src/features/orders/usePlaceOrder.ts": "React Query mutation hook for creating new orders, sanitizing and validating weight inputs, calling the backend actor's placeOrder method, and invalidating related queries on success.",
  "frontend/src/features/orders/useRecentOrders.ts": "React Query hook that fetches a list of recent orders from the backend actor with configurable count parameter.",
  "frontend/src/features/orders/useUpdateOrder.ts": "React Query mutation hook for updating existing orders, sanitizing weights and delivery date, calling the backend actor's updateOrder method, and invalidating related queries on success.",
  "frontend/src/features/repairs/RepairOrdersView.tsx": "Displays a table of repair orders with status badges, formatted currency and weight values, edit actions, and success messages. Uses useRecentRepairOrders hook for data fetching.",
  "frontend/src/features/repairs/repairTypes.ts": "Defines TypeScript types, constants, and initial form data for repair orders including materials, statuses, and delivery statuses.",
  "frontend/src/features/repairs/RepairWizard.tsx": "Multi-step wizard component for creating and editing repair orders with form validation, step navigation, and integration with repair order mutations and queries.",
  "frontend/src/features/repairs/useGetRepairOrder.ts": "React Query hook to fetch a single repair order by ID with error handling for authorization and not-found cases.",
  "frontend/src/features/repairs/usePlaceRepairOrder.ts": "React Query mutation hook to create new repair orders, converting form data to backend format with validation and query invalidation on success.",
  "frontend/src/features/repairs/useRecentRepairOrders.ts": "React Query hook to fetch a list of recent repair orders with configurable count parameter.",
  "frontend/src/features/repairs/useRepairOrderStats.ts": "React Query hook to fetch aggregate statistics for repair orders from the backend.",
  "frontend/src/features/repairs/useUpdateRepairOrder.ts": "React Query mutation hook to update existing repair orders, converting form data to backend format with validation and query invalidation.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication and automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Contains a single query hook for fetching the current user's role; kept for potential future backend query expansion.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a jewelry-themed color palette for light and dark modes using gold, amber, and copper tones.",
  "frontend/src/lib/formatters.ts": "Provides utility functions for formatting and converting data types between frontend display and backend storage, including date/timestamp conversions, weight formatting, currency handling, and bigint validation with extensive logging.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme colors using OKLCH color space, typography, animations, and design tokens for a consistent UI design system.",
  "project_state.json": "Project metadata tracking known issues (data loss and order save failures), existing features, and pending feature requests focused on fixing backend state persistence and stable storage."
}