{
  "backend/main.mo": "Main Motoko actor implementing user profiles, employee management (add/list), and order management (place/update/list/delete) with access control, authorization mixins, and role-based permissions for users and admins.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence issues related to data fetching problems in OrdersView, RepairOrdersView, and service list views (piercing/other services) with their associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, views, and utilities, describing their functionality, data flow, error handling, and integration with backend queries.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a complete design system using OKLCH color space for light and dark modes with jewellery-themed neutral tones.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and title describing the jewellery order/billing app functionality.",
  "frontend/src/App.tsx": "Root application component managing authentication state, view routing between dashboard/wizard/orders/repair views, edit flows with number-based IDs, and success payload handling with toast notifications.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice with dynamic current year in a bordered card layout.",
  "frontend/src/components/Header.tsx": "Application header with branding, Internet Identity login/logout functionality, and a Misc dropdown menu providing navigation to Piercing and Other service forms.",
  "frontend/src/components/LoginPrompt.tsx": "Login prompt card component with Internet Identity integration, displaying welcome message and login button for unauthenticated users.",
  "frontend/src/components/ProfileSetup.tsx": "Profile setup form component for first-time users to enter their name after authentication (content truncated in source).",
  "frontend/src/components/StepIndicator.tsx": "A reusable step indicator component that displays a horizontal progress bar with numbered/checked circles and labels for multi-step forms or wizards.",
  "frontend/src/features/dashboard/DashboardView.tsx": "Main dashboard view component that displays statistics cards, recent orders/repairs/services tables, and provides navigation to create/edit various entities (orders, repairs, piercing services, other services, employees).",
  "frontend/src/features/dashboard/useOrderStats.ts": "React Query hook that fetches order statistics from the backend actor using the getOrderStats method.",
  "frontend/src/features/employees/EmployeeForm.tsx": "Dialog form component for adding new employees with name and phone number fields, including validation and error handling.",
  "frontend/src/features/employees/useAddEmployee.ts": "React Query mutation hook that creates a new employee via the backend actor's addEmployee method and invalidates the employees query cache on success.",
  "frontend/src/features/employees/useListEmployees.ts": "React Query hook that fetches the list of all employees from the backend actor using the listEmployees method.",
  "frontend/src/features/misc/otherTypes.ts": "TypeScript type definitions and initial state for the 'other service' form data (name, phone, amount, remarks).",
  "frontend/src/features/misc/OtherWizard.tsx": "Two-step wizard component for creating 'other' services with contact details (step 1) and amount/remarks (step 2), using StepIndicator for navigation.",
  "frontend/src/features/misc/piercingTypes.ts": "TypeScript type definitions and initial state for the piercing service form data (date, name, phone, amount, remarks).",
  "frontend/src/features/misc/PiercingWizard.tsx": "Two-step wizard component for creating piercing services with basic details including date (step 1) and amount/remarks (step 2), using StepIndicator for navigation.",
  "frontend/src/features/misc/useGetAllOtherServices.ts": "React Query hook that fetches all 'other' service records from the backend actor using the getAllOtherServices method.",
  "frontend/src/features/misc/useGetAllPiercingServices.ts": "React Query hook that fetches all piercing service records from the backend actor using the getAllPiercingServices method.",
  "frontend/src/features/misc/useGetOtherService.ts": "React Query hook to fetch a single OtherServiceRecord by serviceId, with error handling for unauthorized access and not-found cases.",
  "frontend/src/features/misc/useGetPiercingService.ts": "React Query hook to fetch a single PiercingServiceRecord by serviceId, with error handling for unauthorized access and not-found cases.",
  "frontend/src/features/misc/useOtherServiceStats.ts": "React Query hook to fetch OtherServiceStats with authorization error handling.",
  "frontend/src/features/misc/usePiercingServiceStats.ts": "React Query hook to fetch PiercingStats with authorization error handling.",
  "frontend/src/features/misc/usePlaceOtherService.ts": "React Query mutation hook to create a new other service, converting currency to BigInt cents and invalidating related queries on success.",
  "frontend/src/features/misc/usePlacePiercingService.ts": "React Query mutation hook to create a new piercing service, converting date to nanoseconds and currency to BigInt cents, then invalidating related queries on success.",
  "frontend/src/features/misc/useRecentOtherServices.ts": "React Query hook to fetch a list of recent OtherServiceRecords with configurable count, handling authorization errors.",
  "frontend/src/features/misc/useRecentPiercingServices.ts": "React Query hook to fetch a list of recent PiercingServiceRecords with configurable count, handling authorization errors.",
  "frontend/src/features/orders/OrdersView.tsx": "Table view component displaying all orders with status badges, formatted dates/weights, and actions for creating new orders or editing existing ones. Shows success alerts after order operations.",
  "frontend/src/features/orders/orderTypes.ts": "Type definitions and constants for order materials, types, statuses, and form data structure. Includes getWeightFieldsEnabled function that determines which weight fields are active based on order type.",
  "frontend/src/features/orders/OrderWizard.tsx": "Multi-step form wizard component for creating or editing orders with material/order type selection, weight calculations, and employee assignment. Supports both create and edit modes with conditional field enabling based on material and order type.",
  "frontend/src/features/orders/useGetAllOrders.ts": "React Query hook to fetch all OrderRecords with detailed console logging and authorization error handling.",
  "frontend/src/features/orders/useGetOrder.ts": "React Query hook to fetch a single OrderRecord by billNo, with error handling for unauthorized access and not-found cases.",
  "frontend/src/features/orders/usePlaceOrder.ts": "React Query mutation hook for creating new orders, handling form data conversion (weights, assignments), validation, and backend actor calls with error formatting and query invalidation on success.",
  "frontend/src/features/orders/useRecentOrders.ts": "React Query hook that fetches a specified count of recent orders from the backend actor, enabled only when the actor is available.",
  "frontend/src/features/orders/useUpdateOrder.ts": "React Query mutation hook for updating existing orders, converting and validating weights, delivery dates, and assignments before calling the backend actor and invalidating related queries.",
  "frontend/src/features/repairs/RepairOrdersView.tsx": "Component displaying all repair orders in a table with status badges, formatting for currency and weights, and a warning alert about disabled editing due to missing repair IDs in backend records.",
  "frontend/src/features/repairs/repairTypes.ts": "TypeScript type definitions and constants for repair orders including materials, statuses, delivery statuses, form data interface, and initial form values.",
  "frontend/src/features/repairs/RepairWizard.tsx": "Multi-step wizard component for creating or editing repair orders with form validation, auto-calculated total cost, employee assignment, and integration with place/update mutation hooks.",
  "frontend/src/features/repairs/useGetAllRepairOrders.ts": "React Query hook that fetches all repair orders from the backend actor with error handling for unauthorized access and detailed console logging.",
  "frontend/src/features/repairs/useGetRepairOrder.ts": "React Query hook for fetching a single repair order by ID with error handling for authorization, not found cases, and conditional enabling based on repair ID presence.",
  "frontend/src/features/repairs/usePlaceRepairOrder.ts": "React Query mutation hook for creating repair orders, converting dates, weights, and currency values to backend format with validation and query invalidation on success.",
  "frontend/src/features/repairs/useRecentRepairOrders.ts": "React Query hook that fetches a specified count of recent repair orders from the backend actor, enabled when actor is available.",
  "frontend/src/features/repairs/useRepairOrderStats.ts": "React Query hook that fetches repair order statistics from the backend actor with single retry on failure.",
  "frontend/src/features/repairs/useUpdateRepairOrder.ts": "React Query mutation hook for updating repair orders; converts form data (dates, weights, currency) to backend format, validates ranges, calls actor's updateRepairOrder method, and invalidates related queries on success.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state; initializes access control with admin token and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication; manages AuthClient lifecycle, login/logout flow, identity state, and provides authentication status throughout the application.",
  "frontend/src/hooks/useQueries.ts": "Contains a single React Query hook (useGetCallerUserRole) for fetching the current user's role from the backend actor; marked as kept for potential future use.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a jewellery-themed color palette (warm gold, amber, copper tones) for both light and dark modes using HSL color space.",
  "frontend/src/lib/formatters.ts": "Utility functions for converting between display and backend storage formats: timestamps (nanoseconds), weights (multiplied by 100), currency (cents), and includes validation, error handling, and backend error message formatting.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear sensitive parameters from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system, Inter font family, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata tracking Version 26 debugging efforts, documenting known data fetching issues in OrdersView, RepairOrdersView, and service record list views, with pending feature requests to fix backend queries and add error logging."
}