{
  "backend/main.mo": "Motoko canister handling user profiles and order records with access control, providing CRUD operations for profiles and orders.",
  "feature_evidence.json": "Feature evidence report mapping UX behaviors to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "A prewritten set of summaries describing major frontend files and their responsibilities.",
  "frontend/index.css": "Global Tailwind-based OKLCH theme variables defining light/dark mode colors and layout tokens.",
  "frontend/index.html": "Base HTML file bootstrapping the React app and mounting the root element.",
  "frontend/src/App.tsx": "Main app container managing authentication, navigation, and view rendering for dashboard, wizard, and orders.",
  "frontend/src/components/Footer.tsx": "Simple footer showing only the current year.",
  "frontend/src/components/Header.tsx": "Header with branding and authentication controls using Internet Identity.",
  "frontend/src/components/LoginPrompt.tsx": "Card prompting unauthenticated users to log in with Internet Identity.",
  "frontend/src/components/ProfileSetup.tsx": "Empty placeholder for a future profile setup component.",
  "frontend/src/components/StepIndicator.tsx": "Visual step indicator component showing progress across multiple steps.",
  "frontend/src/features/dashboard/DashboardView.tsx": "Displays order statistics, material breakdown, and a preview of recent orders with loading and error handling. Uses callbacks to create or view orders and edit recent ones.",
  "frontend/src/features/dashboard/useOrderStats.ts": "Fetches aggregated order statistics from the backend via react-query and the actor identity. Enabled only when the actor is available.",
  "frontend/src/features/orders/OrdersView.tsx": "Shows a list of recent orders with loading and error states and allows creating or editing orders. Displays a success banner after saving or updating an order.",
  "frontend/src/features/orders/orderTypes.ts": "Defines materials, order types, statuses, initial form data, and logic for enabling weight fields based on the selected order type. Provides type-safe structures for order form handling.",
  "frontend/src/features/orders/OrderWizard.tsx": "Multi-step form for creating or editing orders, handling field state, validation, mode switching, and submitting via place or update mutations. Loads existing order data when editing.",
  "frontend/src/features/orders/useGetOrder.ts": "Retrieves a single order by bill number with detailed error handling for authorization and missing records. Query runs only when an actor is available and a bill number is provided.",
  "frontend/src/features/orders/usePlaceOrder.ts": "Mutation hook to create a new order, sanitizing numeric inputs and invoking the backend actor. Invalidates recent orders and stats on success.",
  "frontend/src/features/orders/useRecentOrders.ts": "Fetches a limited list of recent orders using the backend actor and react-query. Automatically updates when actor changes.",
  "frontend/src/features/orders/useUpdateOrder.ts": "Mutation hook to update an existing order with numeric sanitization and error handling. Refreshes recent orders and stats after success.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, reinitializing on identity changes and invalidating dependent queries. Handles access control initialization via a secret token.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query hook to fetch the caller's user role using an actor, though currently unused.",
  "frontend/src/index.css": "Sets up Tailwind base styles and defines light and dark theme color variables for the jewellery theme.",
  "frontend/src/lib/formatters.ts": "Contains helpers for formatting dates from nanoseconds and converting stored weight values to display format.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL parameters and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Tracks project metadata, versions, and feature requests for the Jewellery Orders project."
}