{
  "backend/main.mo": "Main actor implementing user profile management with access control, and order management (place, update, get, list) with authorization checks, bill number auto-increment, and OrderRecord type definition including weights and delivery tracking.",
  "backend/migration.mo": "Migration module defining type schemas for UserProfile, OrderRecord, RepairOrderRecord, PiercingServiceRecord, and OtherServiceRecord, with a run function that copies state from old to new actor versions.",
  "feature_evidence.json": "Empty feature evidence report with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, views, and utilities for the jewellery order management application with multi-step wizards, authentication, and service tracking.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining design tokens for background, foreground, primary, secondary, borders, and chart colors.",
  "frontend/index.html": "HTML entry point with root div and module script reference for the jewellery order/billing React application.",
  "frontend/src/App.tsx": "Root application component managing authentication state, view routing between dashboard/wizard/orders/repair/piercing/other, edit flows with billNo/repairId tracking, and success payload handling with toast notifications.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice with current year.",
  "frontend/src/components/Header.tsx": "Application header with branding, authentication controls (login/logout), and Misc dropdown menu for navigating to Piercing and Other service forms.",
  "frontend/src/components/LoginPrompt.tsx": "Login prompt card component with Internet Identity integration for unauthenticated users.",
  "frontend/src/components/ProfileSetup.tsx": "Empty profile setup component file.",
  "frontend/src/components/StepIndicator.tsx": "Reusable multi-step progress indicator component displaying numbered steps with labels, check marks for completed steps, and visual highlighting for the current step.",
  "frontend/src/features/dashboard/DashboardView.tsx": "Main dashboard component that displays statistics cards and recent records for orders, repairs, piercing services, and other services. Includes a dropdown menu for creating new records and tables showing recent entries with edit actions.",
  "frontend/src/features/dashboard/useOrderStats.ts": "React Query hook that fetches order statistics from the backend actor. Returns aggregated order data for dashboard display.",
  "frontend/src/features/misc/otherTypes.ts": "TypeScript type definitions and initial state for 'other' service form data including name, phone, amount, and remarks fields.",
  "frontend/src/features/misc/OtherWizard.tsx": "Two-step wizard form for creating 'other' service records with contact details and amount/remarks steps. Validates input and submits via usePlaceOtherService mutation.",
  "frontend/src/features/misc/piercingTypes.ts": "TypeScript type definitions and initial state for piercing service form data including date, name, phone, amount, and remarks fields.",
  "frontend/src/features/misc/PiercingWizard.tsx": "Two-step wizard form for creating piercing service records with basic details (date, name, phone) and amount/remarks steps. Validates input and submits via usePlacePiercingService mutation.",
  "frontend/src/features/misc/useGetOtherService.ts": "React Query hook that fetches a single 'other' service record by ID from the backend actor with error handling for authorization and not-found cases.",
  "frontend/src/features/misc/useGetPiercingService.ts": "React Query hook that fetches a single piercing service record by ID from the backend actor with error handling for authorization and not-found cases.",
  "frontend/src/features/misc/useOtherServiceStats.ts": "React Query hook that fetches aggregated statistics for 'other' services from the backend actor with authorization error handling.",
  "frontend/src/features/misc/usePiercingServiceStats.ts": "React Query hook that fetches aggregated statistics for piercing services from the backend actor with authorization error handling.",
  "frontend/src/features/misc/usePlaceOtherService.ts": "React Query mutation hook that creates a new 'other' service record by converting currency to bigint cents, validating ranges, and calling the backend actor's addOtherService method.",
  "frontend/src/features/misc/usePlacePiercingService.ts": "React Query mutation hook that creates a new piercing service record by converting date to nanoseconds and currency to bigint cents, validating ranges, and calling the backend actor's addPiercingService method.",
  "frontend/src/features/misc/useRecentOtherServices.ts": "React Query hook that fetches a specified count of recent 'other' service records from the backend actor with authorization error handling.",
  "frontend/src/features/misc/useRecentPiercingServices.ts": "React Query hook that fetches a specified count of recent piercing service records from the backend actor with authorization error handling.",
  "frontend/src/features/orders/OrdersView.tsx": "Displays a table of recent orders with status badges, formatting utilities, and actions for creating new orders or editing existing ones.",
  "frontend/src/features/orders/orderTypes.ts": "Defines TypeScript types, constants, and business logic for order materials, types, statuses, and weight field enablement rules based on order type.",
  "frontend/src/features/orders/OrderWizard.tsx": "Multi-step wizard component for creating and editing orders with form validation, weight calculations based on order type, and integration with place/update order mutations.",
  "frontend/src/features/orders/useGetOrder.ts": "React Query hook to fetch a single order by bill number with error handling for authorization and not-found cases.",
  "frontend/src/features/orders/usePlaceOrder.ts": "React Query mutation hook for creating new orders with weight sanitization, validation, and query cache invalidation on success.",
  "frontend/src/features/orders/useRecentOrders.ts": "React Query hook to fetch a list of recent orders with configurable count parameter.",
  "frontend/src/features/orders/useUpdateOrder.ts": "React Query mutation hook for updating existing orders with weight and date conversion, validation, and cache invalidation.",
  "frontend/src/features/repairs/RepairOrdersView.tsx": "Displays a table of repair orders with status badges, currency/weight formatting, and actions for creating or editing repair orders.",
  "frontend/src/features/repairs/repairTypes.ts": "Type definitions and constants for repair orders including materials, statuses, delivery statuses, and the RepairFormData interface with initial values.",
  "frontend/src/features/repairs/RepairWizard.tsx": "Multi-step wizard component for creating and editing repair orders with form validation, step navigation, and integration with repair order mutations and queries.",
  "frontend/src/features/repairs/useGetRepairOrder.ts": "React Query hook to fetch a single repair order by ID with error handling for authorization and not-found cases.",
  "frontend/src/features/repairs/usePlaceRepairOrder.ts": "React Query mutation hook for creating new repair orders with data conversion, validation, and query invalidation on success.",
  "frontend/src/features/repairs/useRecentRepairOrders.ts": "React Query hook to fetch a list of recent repair orders with configurable count parameter.",
  "frontend/src/features/repairs/useRepairOrderStats.ts": "React Query hook to fetch aggregate statistics for repair orders from the backend.",
  "frontend/src/features/repairs/useUpdateRepairOrder.ts": "React Query mutation hook for updating existing repair orders with data conversion, validation, and query invalidation on success.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance, handling authentication state and initializing access control with admin token.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity storage, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Contains useGetCallerUserRole query hook for fetching the current user's role from the backend.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a jewelry-themed color palette for light and dark modes using gold, amber, and copper tones.",
  "frontend/src/lib/formatters.ts": "Provides utility functions for formatting and converting data types between frontend display and backend storage, including date/timestamp conversions, weight formatting, currency conversion to cents, and bigint validation with extensive error handling and logging.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme with OKLCH color system, typography, container queries, animations, and design tokens for a consistent UI design system.",
  "project_state.json": "Project metadata tracking deployment error investigation, migration module state transformation issues, and backend Map data structure initialization problems as pending fix requests."
}