{
  "kind": "build_request",
  "title": "Disable weight and rate/material cost fields when Material is Other; remove footer attribution",
  "projectName": "Jewellery Orders",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "When the Order Wizard form field Material is set to \"Other\", disable the entire Weight step inputs (Exchange Wt, Deduct Wt, Added Wt, and Total Wt) so they are not editable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "if material is selected as\"other\" then deactivate weight section in form."
        ]
      },
      "acceptanceCriteria": [
        "In OrderWizard Step 2 (Weight), when Material = \"Other\", the inputs Exchange Wt, Deduct Wt, and Added Wt are disabled (non-interactive) and visually appear disabled (e.g., muted styling).",
        "Total Wt remains non-editable (as it already is) and reflects a value consistent with disabled weight inputs (e.g., 0.00 if other weight fields are zeroed).",
        "Switching Material from \"Other\" back to another material re-enables the Weight inputs according to the existing order-type-based rules."
      ]
    },
    {
      "id": "REQ-2",
      "text": "When Material is set to \"Other\", disable the Amount step inputs Rate/gram (ratePerGm) and Material Cost (materialCost) so they are not editable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "and also deactivate Rate/gram , material cost, from amount section."
        ]
      },
      "acceptanceCriteria": [
        "In OrderWizard Step 3 (Amount), when Material = \"Other\", Rate/gram and Material Cost inputs are disabled (non-interactive) and visually appear disabled.",
        "When Material changes to \"Other\", Rate/gram and Material Cost values are set/kept at \"0\" so downstream calculations (e.g., Total Cost) remain consistent.",
        "Switching Material from \"Other\" back to another material re-enables Rate/gram and continues existing auto-calculation behavior for Material Cost."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove the \"© {year} · Built with using caffeine.ai\" attribution from the app footer while keeping the footer component layout intact (no broken spacing).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "also remove © 2026 · Built with using\ncaffeine.ai from footer"
        ]
      },
      "acceptanceCriteria": [
        "The footer no longer displays the \"Built with ... caffeine.ai\" text/link or the heart icon.",
        "The footer still renders without UI glitches (no empty line with odd padding or misalignment)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only).",
    "Do not change backend canister interfaces or Motoko state/schema for this request."
  ],
  "nonGoals": [
    "Adding new materials or changing the MATERIALS list.",
    "Changing how orders are stored or calculated on the backend.",
    "Adding new authentication or permissions behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}