{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix data loss and order save failures - Frontend error handling",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Verify and fix frontend error handling and data validation in the OrderWizard to ensure proper error messages are shown if backend operations fail",
      "acceptanceCriteria": [
        "Clear error messages are displayed when order save fails",
        "Frontend properly handles and displays backend error responses",
        "User receives feedback about what went wrong during save operations"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/orders/usePlaceOrder.ts",
          "operation": "modify",
          "description": "Enhance error handling in the usePlaceOrder mutation hook to catch and properly format backend errors (including authorization traps and validation failures). Add detailed error logging and return user-friendly error messages that explain what went wrong during order creation. Ensure the mutation's onError callback receives structured error information that can be displayed in the UI."
        },
        {
          "path": "frontend/src/features/orders/useUpdateOrder.ts",
          "operation": "modify",
          "description": "Enhance error handling in the useUpdateOrder mutation hook to catch and properly format backend errors. Add detailed error logging for debugging data persistence issues and return user-friendly error messages. Ensure errors related to missing orders, authorization failures, or validation issues are clearly communicated."
        },
        {
          "path": "frontend/src/features/orders/OrderWizard.tsx",
          "operation": "modify",
          "description": "Add comprehensive error display UI in the OrderWizard component. Show toast notifications or error alerts when order save operations fail, displaying the specific error message from the mutation hooks. Add visual feedback during save operations (loading states, disable submit button). Ensure users understand why their order failed to save and what action they should take."
        },
        {
          "path": "frontend/src/features/repairs/usePlaceRepairOrder.ts",
          "operation": "modify",
          "description": "Enhance error handling in the usePlaceRepairOrder mutation hook to catch and properly format backend errors. Add detailed error logging and return user-friendly error messages for repair order creation failures. Handle authorization errors and validation failures gracefully."
        },
        {
          "path": "frontend/src/features/repairs/useUpdateRepairOrder.ts",
          "operation": "modify",
          "description": "Enhance error handling in the useUpdateRepairOrder mutation hook to catch and properly format backend errors. Add detailed error logging for debugging and return user-friendly error messages that explain repair order update failures."
        },
        {
          "path": "frontend/src/features/repairs/RepairWizard.tsx",
          "operation": "modify",
          "description": "Add comprehensive error display UI in the RepairWizard component. Show toast notifications or error alerts when repair order save operations fail, displaying specific error messages. Add loading states and visual feedback during save operations to improve user experience."
        },
        {
          "path": "frontend/src/features/misc/usePlacePiercingService.ts",
          "operation": "modify",
          "description": "Enhance error handling in the usePlacePiercingService mutation hook to catch and properly format backend errors. Add detailed error logging and return user-friendly error messages for piercing service creation failures."
        },
        {
          "path": "frontend/src/features/misc/PiercingWizard.tsx",
          "operation": "modify",
          "description": "Add comprehensive error display UI in the PiercingWizard component. Show toast notifications or error alerts when service save operations fail. Add loading states during save operations."
        },
        {
          "path": "frontend/src/features/misc/usePlaceOtherService.ts",
          "operation": "modify",
          "description": "Enhance error handling in the usePlaceOtherService mutation hook to catch and properly format backend errors. Add detailed error logging and return user-friendly error messages for other service creation failures."
        },
        {
          "path": "frontend/src/features/misc/OtherWizard.tsx",
          "operation": "modify",
          "description": "Add comprehensive error display UI in the OtherWizard component. Show toast notifications or error alerts when service save operations fail. Add loading states during save operations."
        },
        {
          "path": "frontend/src/lib/formatters.ts",
          "operation": "modify",
          "description": "Add utility function for formatting backend error messages into user-friendly text. Include logic to detect common error patterns (authorization failures, validation errors, data not found) and return appropriate user-facing messages. Add function to extract error details from trapped backend calls."
        }
      ]
    }
  ]
}